
Процедура ОбработкаСообщенияСистемыВзаимодействия(Сообщение, ДополнительныеПараметры) 
	
	Автор = Неопределено;
	ВсеПользователи = СистемаВзаимодействия.ПолучитьПользователей();
	Для Каждого ТекПользователь Из ВсеПользователи Цикл
		Если ТекПользователь.Идентификатор = Сообщение.Автор Тогда
			Автор = ТекПользователь;
			Прервать;
		КонецЕсли;
	КонецЦикла;	         
	
	// СтрРазделить(Сообщение.Текст, Символы.ПС)[1]     79148880287
		
	ТекстСообщения = Сообщение.Текст; 
	ВывестиДоступныеКоманды = Ложь;
	
	Если Приветствие(ТекстСообщения) Тогда
		ОтветноеСообщение = СтрШаблон("Добрый день%1!", ?(Автор <> Неопределено, ", " + Автор.Имя, ""));
	ИначеЕсли Прощание(ТекстСообщения) Тогда
		ОтветноеСообщение = "Хорошего дня!";
	ИначеЕсли СтрНайти(НРег(ТекстСообщения), "курс") <> 0 Тогда
		ОтветноеСообщение = КурсВалюты(ТекстСообщения);
	//ИначеЕсли СтрНайти(НРег(ТекстСообщения), "задач") <> 0 Тогда
	//	ОтветноеСообщение = СписокЗадач(ТекстСообщения);
	//ИначеЕсли СтрНайти(НРег(ТекстСообщения), "график") <> 0 Тогда
	//	ОтветноеСообщение = ВыписатьСчет(ТекстСообщения);
	//ИначеЕсли СтрНайти(НРег(ТекстСообщения), "счет") <> 0 Тогда
	//	ОтветноеСообщение = ВыписатьСчет(ТекстСообщения);
	//ИначеЕсли СтрНайти(НРег(ТекстСообщения), "техн") <> 0 Тогда
	//	ОтветноеСообщение = ТехническаяИнформация(Сообщение);
	Иначе
		ОтветноеСообщение = "К сожалению, у меня нет информации по этому вопросу.";
		ВывестиДоступныеКоманды = Истина;
	КонецЕсли;
	
	Ответ = СистемаВзаимодействия.СоздатьСообщение(Сообщение.Обсуждение);
	Ответ.Текст = ОтветноеСообщение;
	Если ВывестиДоступныеКоманды Тогда    
		Ряд1 = Ответ.ПанельКнопок.РядыКнопок.Добавить();
		Кнопка11 = Ряд1.Добавить(ДействиеКнопкиПанелиКнопокСообщенияСистемыВзаимодействия.ОбработатьБотом, "Отчет по задачам");
		Кнопка12 = Ряд1.Добавить(ДействиеКнопкиПанелиКнопокСообщенияСистемыВзаимодействия.ОбработатьБотом, "Выписать счет");
	КонецЕсли;
	Ответ.Записать();
	
КонецПроцедуры        

Функция Приветствие(ТекстСообщения)
	
	Если СтрНайти(НРег(ТекстСообщения), "привет") <> 0
		Или СтрНайти(НРег(ТекстСообщения), "хелло") <> 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция Прощание(ТекстСообщения)
	
	Если СтрНайти(НРег(ТекстСообщения), "пока") <> 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция КурсВалюты(ТекстСообщения)
	
	Если СтрНайти(НРег(ТекстСообщения), "доллар") <> 0 Тогда
		Код = "840";
		ИмяВалюты = "доллара";
	ИначеЕсли СтрНайти(НРег(ТекстСообщения), "евро") <> 0 Тогда
		Код = "978";            
		ИмяВалюты = "евро";
	Иначе
		Возврат "Я не знаю курс данной валюты.";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение("cbrates.rbc.ru");
	HTTPЗапрос = Новый HTTPЗапрос("tsv/" + Код + Формат(ТекущаяДата(), "ДФ=/yyyy/MM/dd") + ".tsv");
	Ответ = Соединение.Получить(HTTPЗапрос);
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат "Не удается связаться в банком. Повторите позже.";
	Иначе
		ОтветБанка = Ответ.ПолучитьТелоКакСтроку();
		
		М = СтрРазделить(ОтветБанка, Символы.Таб);
		Курс = Число(М[1]) / Число(М[0]);
		
		Возврат СтрШаблон("Курс %1 сегодня: %2 рубля", ИмяВалюты, Курс);
	КонецЕсли;
	
КонецФункции

Функция СписокЗадач(ТекстСообщения)
	
	ОтветноеСообщение = "Список открытых задач:" + Символы.ПС + "---" + Символы.ПС;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уз_Задача.Дата КАК Дата,
	|	уз_Задача.Заголовок КАК Заголовок
	|ИЗ
	|	Документ.уз_Задача КАК уз_Задача
	|ГДЕ
	|	уз_Задача.Контрагент.Наименование = &Наименование
	|	И уз_Задача.Состояние = &Состояние";
	Запрос.УстановитьПараметр("Наименование", "Инэкс-Групп-Сервис ООО");
	Запрос.УстановитьПараметр("Состояние", ПредопределенноеЗначение("Перечисление.уз_СостоянияЗадачи.Принята"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Выборка.Дата + " " + Выборка.Заголовок;
	КонецЦикла;   
	
	Возврат ОтветноеСообщение;
	
КонецФункции

Функция ВыписатьСчет(ТекстСообщения)
	
	ОтветноеСообщение = "Счет" + Символы.ПС + "---" + Символы.ПС;
	
	Возврат ОтветноеСообщение;
	
КонецФункции  

Функция ПечатьКартинки()
	
	Картинка = БиблиотекаКартинок.ВариантПрайсЛистаПолотно;
	Поток = Новый ПотокВПамяти;
	Картинка.Записать(Поток);
	ДанныеКартинки = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДанныеКартинки.ОткрытьПотокДляЧтения();
	
КонецФункции

Функция ПечатьСчета()
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	Макет = Обработки.ПечатьСчетНаОплату.ПолучитьМакет("ПФ_MXL_СчетНаОплату");
	
	ОбластьЗаголовокСчета						= Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьЗаголовок							= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПоставщик							= Макет.ПолучитьОбласть("Поставщик");
	ОбластьПокупатель							= Макет.ПолучитьОбласть("Покупатель");
	ОбластьШапкаТаблицы							= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаГруппировка					= Макет.ПолучитьОбласть("СтрокаГруппировка");
	ОбластьСтрока								= Макет.ПолучитьОбласть("Строка");
	ОбластьИтогоКОплате							= Макет.ПолучитьОбласть("ИтогоКОплате");
	ОбластьСуммаПрописью						= Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьПодписиПредпринимателяБезФаксимиле	= Макет.ПолучитьОбласть("ПодписиПредпринимателяБезФаксимиле");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовокСчета);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьПоставщик);
	ТабличныйДокумент.Вывести(ОбластьПокупатель);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировка);
	ТабличныйДокумент.Вывести(ОбластьСтрока);
	ТабличныйДокумент.Вывести(ОбластьИтогоКОплате);
	ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
	ТабличныйДокумент.Вывести(ОбластьПодписиПредпринимателяБезФаксимиле);
	
    Поток = Новый ПотокВПамяти;
	ТабличныйДокумент.Записать(Поток, ТипФайлаТабличногоДокумента.PDF);
	ДанныеПечатнойФормы = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДанныеПечатнойФормы.ОткрытьПотокДляЧтения();
	
КонецФункции

Функция ТехническаяИнформация(Сообщение)
	                                                                                  
	ОтветноеСообщение = "Техническая информация:" + Символы.ПС + "---";
	
	Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(Сообщение.Обсуждение);
	
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + "Групповое: " + Строка(Обсуждение.Групповое);
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + "Заголовок: " + Обсуждение.Заголовок;
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + "Идентификатор: " + Строка(Обсуждение.Идентификатор);
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + "Ключ: " + Обсуждение.Ключ;
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + "КонтекстОбсуждения: " + Строка(Обсуждение.КонтекстОбсуждения);
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + "Отображаемое: " + Строка(Обсуждение.Отображаемое);
	
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + "Интеграция: ";
	Интеграция = СистемаВзаимодействия.ПолучитьИнтеграцию(Обсуждение.Интеграция);
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "ДоступноРедактированиеСообщения: " + Строка(Интеграция.ДоступноРедактированиеСообщения);
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "ДоступныВидеоконференции: " + Строка(Интеграция.ДоступныВидеоконференции);
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "Идентификатор: " + Строка(Интеграция.Идентификатор);
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "Использование: " + Строка(Интеграция.Использование);
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "Ключ: " + Интеграция.Ключ;
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "НавигационнаяСсылкаТочкиПодключения: " + Интеграция.НавигационнаяСсылкаТочкиПодключения;
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "Представление: " + Интеграция.Представление;
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "ТипВнешнейСистемы: " + Интеграция.ТипВнешнейСистемы;
	
	ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + "Участники: ";
	Для Каждого ТекУчастник Из Обсуждение.Участники Цикл
		ТекПользователь = СистемаВзаимодействия.ПолучитьПользователя(ТекУчастник);
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "АдминистраторАбонента: " + Строка(ТекПользователь.АдминистраторАбонента);
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "АдресЭлектроннойПочты: " + ТекПользователь.АдресЭлектроннойПочты;
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "Внешний: " + Строка(ТекПользователь.Внешний);
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "Идентификатор: " + Строка(ТекПользователь.Идентификатор);
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "ИдентификаторПользователяВнешнейСистемы : " + Строка(ТекПользователь.ИдентификаторПользователяВнешнейСистемы);
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "ИдентификаторПользователяИнформационнойБазы  : " + Строка(ТекПользователь.ИдентификаторПользователяИнформационнойБазы);
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "Имя: " + ТекПользователь.Имя;
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "НомерТелефона  : " + ТекПользователь.НомерТелефона;
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "ПолноеИмя: " + ТекПользователь.ПолноеИмя;
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "Псевдоним: " + ТекПользователь.Псевдоним;
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС + Символы.Таб + "ТипВнешнейСистемы  : " + ТекПользователь.ТипВнешнейСистемы;
		ОтветноеСообщение = ОтветноеСообщение + Символы.ПС;
	КонецЦикла;
		
	Возврат ОтветноеСообщение;
	
КонецФункции        

Процедура ОбработкаНажатияКнопкиПанелиКнопокСообщенияСистемыВзаимодействия(Сообщение, Кнопка, Пользователь, ДополнительныеПараметры)
	
	ТекстСообщения = Сообщение.Текст;
	
	Ответ = СистемаВзаимодействия.СоздатьСообщение(Сообщение.Обсуждение);
	
	КомандаКнопки = Кнопка.Текст;
	Если КомандаКнопки = "Отчет по задачам" Тогда
		ОтветноеСообщение = СписокЗадач(ТекстСообщения);
		Ответ.Текст = ОтветноеСообщение;
	ИначеЕсли КомандаКнопки = "Выписать счет" Тогда
		Ответ.Текст = "Счет на " + Формат(ТекущаяДата(), "ДЛФ=DD");
		Ответ.Вложения.Добавить(ПечатьСчета(), "Счет.pdf", "application/pdf");
	Иначе                               
		//Ответ.Вложения.Добавить(ПечатьКартинки(), "Картинка.png", "image/png");
		Ответ.Текст = "Неизвестная команда";
	КонецЕсли; 
	
	Ответ.Записать();

КонецПроцедуры
